

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОказаниеУслуг 
	Движения.ОказаниеУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаОказаниеУслуг Из ОказаниеУслуг Цикл
		Движение = Движения.ОказаниеУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Наименование = ТекСтрокаОказаниеУслуг.Наименование;
		Движение.Количество = ТекСтрокаОказаниеУслуг.Количество;
		Движение.Цена = ТекСтрокаОказаниеУслуг.Цена;
	КонецЦикла;

	// регистр Недвижимость 
	Движения.Недвижимость.Записывать = Истина;
	Для Каждого ТекСтрокаСтоимость Из Стоимость Цикл
		Движение = Движения.Недвижимость.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектНедвижимости = ОбъектНедвижимости;
		Движение.Цена = ТекСтрокаСтоимость.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
                                                          