
&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	СТЧ=Элементы.Номенклатура.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры      
             
&НаКлиенте

Процедура НоменклатураКоличествоПриИзменении(Элемент)
	СТЧ=Элементы.Номенклатура.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры
&НаКлиенте
Процедура НоменклатураНаименованиеПриИзменении(Элемент)
СтрокаРасчета = Элементы.Номенклатура.ТекущиеДанные;
СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Наименование);
НоменклатураЦенаПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену (НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
	  КонецФункции              


	  
