
&НаКлиенте
Процедура ОказаниеУслугСуммаПриИзменении(Элемент)
	СТЧ=Элементы.ОказаниеУслуг.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры      

&НаКлиенте
Процедура ОказаниеУслугЦенаПриИзменении(Элемент)
	СТЧ=Элементы.ОказаниеУслуг.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ОказаниеУслугКоличествоПриИзменении(Элемент)
	СТЧ=Элементы.ОказаниеУслуг.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры


&НаКлиенте
Процедура Стоимость1ЦенаЗаКвМПриИзменении(Элемент)
	СТЧ=Элементы.Стоимость1.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Площадь * СТЧ.ЦенаЗаКвМ;
КонецПроцедуры  
                     &НаКлиенте
Процедура Стоимость1ПлощадьПриИзменении(Элемент)
	СТЧ=Элементы.Стоимость1.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Площадь * СТЧ.ЦенаЗаКвМ;
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 Объект.СуммаПоДокументу=Объект.ОказаниеУслуг.Итог("Сумма")+Объект.Стоимость.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении(Элемент)
	Объект.СуммаПоДокументу=Объект.ОказаниеУслуг.Итог("Сумма")+Объект.Стоимость.Итог("Сумма");
КонецПроцедуры
                 
&НаКлиенте 
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл,ДопПараметр) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры
&НаКлиенте 
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла,ДопПараметры) Экспорт 
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	СсылкаНаКартинку = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку); 
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка"); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Картинка");
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	Фильтр = "Файл Jpg (*.jpg)|*.jpg"; 
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);	
КонецПроцедуры




     &НаКлиенте
Процедура Стоимость1РайонПриИзменении(Элемент)
СтрокаРасчета = Элементы.Стоимость1.ТекущиеДанные;
СтрокаРасчета.ЦенаЗаКвМ = ПолучитьЦену(СтрокаРасчета.Район);
Стоимость1ЦенаЗаКвМПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену (НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
	  КонецФункции                    
	  
	  
	  
     &НаКлиенте
Процедура ОказаниеУслугНаименованиеПриИзменении(Элемент)
СтрокаРасчета = Элементы.ОказаниеУслуг.ТекущиеДанные;
СтрокаРасчета.Цена = ПолучитьЦену1(СтрокаРасчета.Наименование);
ОказаниеУслугЦенаПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену1 (НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
	  КонецФункции              
	  
                            &НаКлиенте
Процедура Стоимость1УлицаПриИзменении(Элемент)
СтрокаРасчета = Элементы.Стоимость1.ТекущиеДанные;
СтрокаРасчета.БлизостьКЦентруГорода = ПолучитьЦену2(СтрокаРасчета.Улица);
Стоимость1БлизостьКЦентруГородаПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену2 (НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
	  КонецФункции 
	                          &НаКлиенте
Процедура Стоимость1ДатаПостройкиПриИзменении(Элемент)
СтрокаРасчета = Элементы.Стоимость1.ТекущиеДанные;
СтрокаРасчета.ЗаДату = ПолучитьЦену3(СтрокаРасчета.ДатаПостройки);
Стоимость1БлизостьКЦентруГородаПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену3 (НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
	  КонецФункции 

	  &НаКлиенте
Процедура Стоимость1БлизостьКЦентруГородаПриИзменении(Элемент)
	СТЧ=Элементы.Стоимость1.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Площадь * СТЧ.ЦенаЗаКвМ + СТЧ.БлизостьКЦентруГорода + СТЧ.ЗаДату;
КонецПроцедуры  
		