
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Кровь Приход
	Движения.Кровь.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.Кровь.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ГруппаКрови = ТекСтрокаТабличнаяЧасть1.ГруппаКрови;
		Движение.ФИО = ТекСтрокаТабличнаяЧасть1.Доноры;
		Движение.количество = ТекСтрокаТабличнаяЧасть1.количество;
	КонецЦикла;

	// регистр ОбщееКоличествоКрови Приход
	Движения.ОбщееКоличествоКрови.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.ОбщееКоличествоКрови.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ГруппаКрови = ТекСтрокаТабличнаяЧасть1.ГруппаКрови;
		Движение.количество = ТекСтрокаТабличнаяЧасть1.количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
